app/controllers/home_controller.rb

  def index
  	@ad_details = Product.all
---
SELECT "products".* FROM "products"

  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(product_params)
---
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "ad_title" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["ad_title", "1 BHK fully furnished flat in Andheri East"], ["updated_at", "2014-09-07 11:19:06.144050"]]