app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "ad_title" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["ad_title", "fully furnished flat in Andheri East"], ["updated_at", "2014-09-06 14:17:35.428013"]]
---
  def update
    @product = Product.find(params[:id])
   if @product.update_attributes(product_params)

INSERT INTO "products" ("ad_title", "area", "condition", "created_at", "extra", "owner_type", "rent_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["ad_title", ""], ["area", ""], ["condition", ""], ["created_at", "2014-09-02 18:45:00.864276"], ["extra", ""], ["owner_type", ""], ["rent_type", ""], ["updated_at", "2014-09-02 18:45:00.864276"]]
---
  def create
    @product = Product.new(product_params)

      if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 4]]
SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 4]]
---
  def destroy
    product = Product.find(params[:id]).destroy