app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."user_name" IS NULL LIMIT 1
---
  def validateMe
    @user = User.where(:user_name => (params[:user_name]) )